sampleSOAP.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://purolator.com/pws/datatypes/v1">
	<soap:Header>
		<RequestContext>
			<Version>1.1</Version>
			<Language>en</Language>
			<GroupID/>
			<RequestReference/>
			<UserToken/>
		</RequestContext>
	</soap:Header>
	<soap:Body>
		<FreightGetEstimateRequest>
			<Estimate>
				<SenderInformation>
					<Address>
						<Name>Tech A</Name>
						<Company>Purolator</Company>
						<StreetNumber>17718</StreetNumber>
						<StreetName>114 Avenue</StreetName>
						<City>Edmonton</City>
						<Province>AB</Province>
						<Country>CA</Country>
						<PostalCode>T5S2N4</PostalCode>
						<PhoneNumber>
							<CountryCode>1</CountryCode>
							<AreaCode>780</AreaCode>
							<Phone>4091270</Phone>
						</PhoneNumber>
					</Address>
				</SenderInformation>
				<ReceiverInformation>
					<Address>
						<Name>Tech B</Name>
						<Company>Purolator</Company>
						<StreetNumber>21</StreetNumber>
						<StreetName>AERO DR NE</StreetName>
						<City>CALGARY</City>
						<Province>AB</Province>
						<Country>CA</Country>
						<PostalCode>T2E8Z9</PostalCode>
						<PhoneNumber>
							<CountryCode>1</CountryCode>
							<AreaCode>780</AreaCode>
							<Phone>4091270</Phone>
						</PhoneNumber>
					</Address>
				</ReceiverInformation>
				<PaymentInformation>
					<PaymentType>Sender</PaymentType>
					<RegisteredAccountNumber>F271</RegisteredAccountNumber>
					<BillingAccountNumber>F271</BillingAccountNumber>
				</PaymentInformation>
				<ShipmentDetails>
					<ServiceTypeCode>S</ServiceTypeCode>
					<ShipmentDate>2025-11-19</ShipmentDate>
					<LineItemDetails>
						<LineItem>
							<LineNumber>1</LineNumber>
							<Pieces>2</Pieces>
							<HandlingUnit>1</HandlingUnit>
							<HandlingUnitType>PALLET</HandlingUnitType>
							<Weight>
								<Value>81.65</Value>
								<WeightUnit>kg</WeightUnit>
							</Weight>
							<Length>
								<Value>25.4</Value>
								<DimensionUnit>cm</DimensionUnit>
							</Length>
							<Width>
								<Value>25.4</Value>
								<DimensionUnit>cm</DimensionUnit>
							</Width>
							<Height>
								<Value>25.4</Value>
								<DimensionUnit>cm</DimensionUnit>
							</Height>
						</LineItem>
						<LineItem>
							<LineNumber>2</LineNumber>
							<Pieces>1</Pieces>
							<HandlingUnit>1</HandlingUnit>
							<HandlingUnitType>skid</HandlingUnitType>
							<Weight>
								<Value>100</Value>
								<WeightUnit>kg</WeightUnit>
							</Weight>
							<Length>
								<Value>25.4</Value>
								<DimensionUnit>cm</DimensionUnit>
							</Length>
							<Width>
								<Value>25.4</Value>
								<DimensionUnit>cm</DimensionUnit>
							</Width>
							<Height>
								<Value>25.4</Value>
								<DimensionUnit>cm</DimensionUnit>
							</Height>
						</LineItem>
					</LineItemDetails>
					<CustomerReferences/>
				</ShipmentDetails>
				<AppointmentFlag>false</AppointmentFlag>
				<PickupFlag>false</PickupFlag>
				<AlertInformation>
					<AlertDetails/>
				</AlertInformation>
			</Estimate>
		</FreightGetEstimateRequest>
	</soap:Body>
</soap:Envelope>

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Header>
      <h:ResponseContext xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:h="http://purolator.com/pws/datatypes/v1">
         <h:ResponseReference>5430f36f-3ebd-4b9d-a477-de0db9904efb</h:ResponseReference>
      </h:ResponseContext>
   </s:Header>
   <s:Body>
      <GetEstimateResponse xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://purolator.com/pws/datatypes/v1">
         <ResponseInformation i:nil="true"/>
         <TariffCode>PURO2018</TariffCode>
         <DiscountPoint>60</DiscountPoint>
         <TransitDays>0</TransitDays>
         <EstimatedDeliveryDate>2025-11-20</EstimatedDeliveryDate>
         <TotalPrice>152.82</TotalPrice>
         <LineItemDetails>
            <LineItem>
               <LineNumber>1</LineNumber>
               <Pieces>2</Pieces>
               <HandlingUnit>1</HandlingUnit>
               <HandlingUnitType i:nil="true"/>
               <Description>1 Pallets OF FREIGHT</Description>
               <Weight>
                  <Value>180</Value>
                  <WeightUnit>LB</WeightUnit>
               </Weight>
               <FreightClass>100</FreightClass>
               <Length>
                  <Value>11</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Length>
               <Width>
                  <Value>11</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Width>
               <Height>
                  <Value>11</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Height>
               <BasePrice>0</BasePrice>
               <Charge>0</Charge>
            </LineItem>
            <LineItem>
               <LineNumber>2</LineNumber>
               <Pieces>1</Pieces>
               <HandlingUnit>1</HandlingUnit>
               <HandlingUnitType i:nil="true"/>
               <Description>1 Skids OF FREIGHT</Description>
               <Weight>
                  <Value>221</Value>
                  <WeightUnit>LB</WeightUnit>
               </Weight>
               <FreightClass>100</FreightClass>
               <Length>
                  <Value>11</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Length>
               <Width>
                  <Value>11</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Width>
               <Height>
                  <Value>11</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Height>
               <BasePrice>0</BasePrice>
               <Charge>0</Charge>
            </LineItem>
            <LineItem>
               <LineNumber>3</LineNumber>
               <Pieces>0</Pieces>
               <HandlingUnit>0</HandlingUnit>
               <HandlingUnitType i:nil="true"/>
               <Description>RATED AS 500 LBS.</Description>
               <Weight>
                  <Value>500</Value>
                  <WeightUnit>LB</WeightUnit>
               </Weight>
               <FreightClass/>
               <Length>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Length>
               <Width>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Width>
               <Height>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Height>
               <BasePrice>76.41</BasePrice>
               <Charge>382.05</Charge>
            </LineItem>
            <LineItem>
               <LineNumber>4</LineNumber>
               <Pieces>0</Pieces>
               <HandlingUnit>0</HandlingUnit>
               <HandlingUnitType i:nil="true"/>
               <Description>DISCOUNT: -60%</Description>
               <Weight>
                  <Value>0</Value>
                  <WeightUnit>LB</WeightUnit>
               </Weight>
               <FreightClass/>
               <Length>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Length>
               <Width>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Width>
               <Height>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Height>
               <BasePrice>0</BasePrice>
               <Charge>-229.23</Charge>
            </LineItem>
            <LineItem>
               <LineNumber>5</LineNumber>
               <Pieces>0</Pieces>
               <HandlingUnit>0</HandlingUnit>
               <HandlingUnitType i:nil="true"/>
               <Description>1 11"x11"x11"</Description>
               <Weight>
                  <Value>0</Value>
                  <WeightUnit>LB</WeightUnit>
               </Weight>
               <FreightClass/>
               <Length>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Length>
               <Width>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Width>
               <Height>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Height>
               <BasePrice>0</BasePrice>
               <Charge>0</Charge>
            </LineItem>
            <LineItem>
               <LineNumber>6</LineNumber>
               <Pieces>0</Pieces>
               <HandlingUnit>0</HandlingUnit>
               <HandlingUnitType i:nil="true"/>
               <Description>2 11"x11"x11"</Description>
               <Weight>
                  <Value>0</Value>
                  <WeightUnit>LB</WeightUnit>
               </Weight>
               <FreightClass/>
               <Length>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Length>
               <Width>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Width>
               <Height>
                  <Value>0</Value>
                  <DimensionUnit>IN</DimensionUnit>
               </Height>
               <BasePrice>0</BasePrice>
               <Charge>0</Charge>
            </LineItem>
         </LineItemDetails>
         <AccessorialDetails i:nil="true"/>
         <ShipmentTaxes i:nil="true"/>
      </GetEstimateResponse>
   </s:Body>
</s:Envelope>